<a href="https://colab.research.google.com/github/Olmaro/Olmaro/blob/main/Pandas_Exercises_on_the_Titanic_Dataset_(Core).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

- Olivia Roberts
- 07/30/2022

#Pandas Exercises on the Titanic Dataset (Core)

##The usual goal of this dataset is to predict survival on the Titanic based on passenger characteristics. For this exercise, you are answering questions about the dataset.

##Your task is to write code to answer all of the following questions:

## - Display the head of the dataframe.

In [154]:
#importing my drive, as always.
from google.colab import drive

In [155]:
#importing pandas, as always.
import pandas as pd

In [156]:
#naming and importing the df, then printing the first 5 lunes of the df.
titanic_df = '/content/drive/MyDrive/Coding Dojo/02 Week 2: Pandas/titanic.csv'
df = pd.read_csv(titanic_df, header = 0)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## - What is the percentage of people who survived? (hint: find the mean of the survival column).

In [157]:
#finding the mean of the Survived column
df['Survived'].mean()

0.3838383838383838

## - How many of each sex survived?

In [158]:
#Filtering the Survived column based on survived == 0. 
#Filtering the Sex column based on gender.
#Comnbining filters and running the length of the new df.
Survived = df['Survived'] ==1
Female = df['Sex'] == 'female'
df[Female & Survived]
len(df[Female & Survived])

233

In [159]:
#Repeating previous step with male instead of female.
Male = df['Sex'] == 'male'
df[Male & Survived]
len(df[Male & Survived])

109

## - Considering only the group of passengers who paid less than $10, what percentage of this group survived? Hint: You can filter the dataframe based on the fare, and then use value_counts(normalize = True) on the "Survived" column to obtain proportions instead of sums. For example 0.25 would indicate 25%

In [160]:
#Filtering the Fare column by the cost of the ticket.
#Combining the  Fare-based filter and the Survived column to find the percentage of survivors who paid under $10 (19.94% survival).
Under10 = df['Fare'] < 10
df.loc[Under10 , 'Survived'].value_counts(normalize = True)

0    0.800595
1    0.199405
Name: Survived, dtype: float64

## - Overall, what is the average age of those who didn't survive?

In [161]:
#Creating filter for the Survived column again.
#Combining filter and Age column to find the average of the two together.
dead = df['Survived'] == 0
df.loc[dead, 'Age'].mean()

30.62617924528302

## - Overall, what is the average age of those who did survive?

In [162]:
#Creating filter for the Survived column again.
#Combining filter and Age column to find the average of the two together.
alive = df['Survived'] == 1
df.loc[alive, 'Age'].mean()

28.343689655172415

## - What is the average age of those who did and didn't survive grouped by Sex?

In [166]:
#Using Grouby technique on all 3 columns to find the mean age of survivors and non survivors based on sex.
df.groupby(['Sex', 'Survived'])['Age'].mean()

Sex     Survived
female  0           25.046875
        1           28.847716
male    0           31.618056
        1           27.276022
Name: Age, dtype: float64